modgenera.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rem="http://ar.gob.afip.wsremazucar/RemAzucarService/">
   <soapenv:Header/>
   <soapenv:Body>
      <rem:generarRemitoRequest>
         <authRequest>
            <token></token>
        	  <sign></sign>
            <cuitRepresentada></cuitRepresentada>
         </authRequest>
         <idReqCliente>:idReqCliente</idReqCliente>
         <remito>
         <esEntregaMostrador>:esEntregaMostrador</esEntregaMostrador>
         <puntoEmision>:puntoEmision</puntoEmision>
         <cuitTitularMercaderia>:cuitTitularMercaderia</cuitTitularMercaderia>
         <tipoTitularMercaderia>:tipoTitularMercaderia</tipoTitularMercaderia>
         <numeroMaquila>:numeroMaquila</numeroMaquila>
         <cuitAutorizadoRetirar>:cuitAutorizadoRetirar</cuitAutorizadoRetirar>
         <receptor>
         <cuitPaisReceptor>:cuitPaisReceptor</cuitPaisReceptor>
         <receptorNacional>
            <cuitReceptor>:cuitReceptor</cuitReceptor>
            <codDomReceptor>:codDomReceptor</codDomReceptor>
         </receptorNacional>         
      </receptor>
      <viaje>
         <fechaInicioViaje>:fechaInicioViaje</fechaInicioViaje>
         <kmDistancia>:kmDistancia</kmDistancia>
         <tramo>
            <automotor>
               <codPaisTransportista>:codPaisTransportista</codPaisTransportista>
               <transporteNacional>
                  <cuitTransportista>:cuitTransportista</cuitTransportista>
                  <cuitConductor>:cuitConductor</cuitConductor>
               </transporteNacional>
               <dominioVehiculo>:dominioVehiculo</dominioVehiculo>
               <dominioAcoplado>:dominioAcoplado</dominioAcoplado>
            </automotor>
         </tramo>
      </viaje>      
         <arrayMercaderias>
            <mercaderia>
                <orden>:orden</orden>
                <anioZafra>:anioZafra</anioZafra>
                <cantidad>:cantidad</cantidad>
                <tipoProducto>:tipoProducto</tipoProducto>
                <unidadMedida>:unidadMedida</unidadMedida>
                <tipoEmbalaje>:tipoEmbalaje</tipoEmbalaje>
            </mercaderia>
        </arrayMercaderias>
      <importeCot>:importeCot</importeCot>
      <comentarios>:comentarios</comentarios>
   </remito>
      </rem:generarRemitoRequest>
   </soapenv:Body>
</soapenv:Envelope>